analogdevicesinc/aducm355-examples/inc/ADuCM355_device.h
/******************************************************************************
Copyright (c) 2017-2019 Analog Devices, Inc. All Rights Reserved.

This software is proprietary to Analog Devices, Inc. and its licensors.
By using this software you agree to the terms of the associated
Analog Devices Software License Agreement.

*****************************************************************************/

#ifndef _ADUCM355_DEVICE_H
#define _ADUCM355_DEVICE_H

/* pickup integer types */
#if defined(_LANGUAGE_C) || (defined(__GNUC__) && !defined(__ASSEMBLER__))
#include <stdint.h>
#endif /* _LANGUAGE_C */

/* pickup register bitfield and bit masks */
#include "ADuCM355_typedefs.h"

#if defined ( __CC_ARM   )
#pragma push
#pragma anon_unions
#endif


#ifdef __cplusplus
  #define   __I     volatile             /*!< Defines 'read only' permissions                 */
#else
  #define   __I     volatile const       /*!< Defines 'read only' permissions                 */
#endif

#ifndef __O
#define   __O     volatile     /* write only */
#endif

#ifndef __IO
#define   __IO    volatile     /* read-write */
#endif


#if defined (_MISRA_RULES)
/*
  anonymous unions violate ISO 9899:1990 and therefore MISRA Rule 1.1.
  Use of unions violates MISRA Rule 18.4.
  Anonymous unions are required for this implementation.
  Re-use of identifiers violates MISRA Rule 5.7.
  Field names are repeated for the ADuCM355 register map.
*/
#pragma diag(push)
#pragma diag(suppress:misra_rule_1_1:"Allow anonymous unions")
#pragma diag(suppress:misra_rule_5_1:"Allow names over 32 character limit")
#pragma diag(suppress:misra_rule_5_3:"Header will re-use typedef identifiers")
#pragma diag(suppress:misra_rule_5_6:"Header will re-use identifiers in the same scope")
#pragma diag(suppress:misra_rule_5_7:"Header will re-use identifiers")
#pragma diag(suppress:misra_rule_18_4:"Allow the use of a union")
#endif /* _MISRA_RULES */

/** @defgroup TMR General Purpose Timer (TMR) Module
 *  General Purpose Timer
 *  @{
 */

/*! ==========================================================================
 *  \struct ADI_TMR_TypeDef
 *  \brief  General Purpose Timer
 *  ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_TMR_TypeDef__
typedef struct _ADI_TMR_TypeDef
{
    __IO     int16_t    LOAD;                          /*!< 16-bit load value */
    __I      uint8_t  RESERVED0[2];
    __I      int16_t    CURCNT;                        /*!< 16-bit timer value */
    __I      uint8_t  RESERVED1[2];
    __IO     uint16_t   CTL;                           /*!< Control */
    __I      uint8_t  RESERVED2[2];
    __O      uint16_t   CLRINT;                        /*!< Clear Interrupt */
    __I      uint8_t  RESERVED3[2];
    __I      int16_t    CAPTURE;                       /*!< Capture */
    __I      uint8_t  RESERVED4[2];
    __IO     int16_t    ALOAD;                         /*!< 16-bit load value, asynchronous */
    __I      uint8_t  RESERVED5[2];
    __I      int16_t    ACURCNT;                       /*!< 16-bit timer value, asynchronous */
    __I      uint8_t  RESERVED6[2];
    __I      uint16_t   STAT;                          /*!< Status */
    __I      uint8_t  RESERVED7[2];
    __IO     uint16_t   PWMCTL;                        /*!< PWM Control Register */
    __I      uint8_t  RESERVED8[2];
    __IO     int16_t    PWMMATCH;                      /*!< PWM Match Value */
} ADI_TMR_TypeDef;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_TMR_TypeDef__ */

/*!@}*/

/** @defgroup RTC Real-Time Clock (RTC) Module
 *  Real-Time Clock
 *  @{
 */

/*! ==========================================================================
 *  \struct ADI_RTC_TypeDef
 *  \brief  Real-Time Clock
 *  ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RTC_TypeDef__
typedef struct _ADI_RTC_TypeDef
{
    __IO     uint16_t   CR0;                           /*!< RTC Control 0 */
    __I      uint8_t  RESERVED0[2];
    __IO     uint16_t   SR0;                           /*!< RTC Status 0 */
    __I      uint8_t  RESERVED1[2];
    __I      uint16_t   SR1;                           /*!< RTC Status 1 */
    __I      uint8_t  RESERVED2[2];
    __IO     uint16_t   CNT0;                          /*!< RTC Count 0 */
    __I      uint8_t  RESERVED3[2];
    __IO     uint16_t   CNT1;                          /*!< RTC Count 1 */
    __I      uint8_t  RESERVED4[2];
    __IO     uint16_t   ALM0;                          /*!< RTC Alarm 0 */
    __I      uint8_t  RESERVED5[2];
    __IO     uint16_t   ALM1;                          /*!< RTC Alarm 1 */
    __I      uint8_t  RESERVED6[2];
    __IO     uint16_t   TRM;                           /*!< RTC Trim */
    __I      uint8_t  RESERVED7[2];
    __O      uint16_t   GWY;                           /*!< RTC Gateway */
    __I      uint8_t  RESERVED8[6];
    __IO     uint16_t   CR1;                           /*!< RTC Control 1 */
    __I      uint8_t  RESERVED9[2];
    __IO     uint16_t   SR2;                           /*!< RTC Status 2 */
    __I      uint8_t  RESERVED10[2];
    __I      uint16_t   SNAP0;                         /*!< RTC Snapshot 0 */
    __I      uint8_t  RESERVED11[2];
    __I      uint16_t   SNAP1;                         /*!< RTC Snapshot 1 */
    __I      uint8_t  RESERVED12[2];
    __I      uint16_t   SNAP2;                         /*!< RTC Snapshot 2 */
    __I      uint8_t  RESERVED13[2];
    __I      uint16_t   MOD;                           /*!< RTC Modulo */
    __I      uint8_t  RESERVED14[2];
    __I      uint16_t   CNT2;                          /*!< RTC Count 2 */
    __I      uint8_t  RESERVED15[2];
    __IO     uint16_t   ALM2;                          /*!< RTC Alarm 2 */
    __I      uint8_t  RESERVED16[2];
    __IO     uint16_t   SR3;                           /*!< RTC Status 3 */
    __I      uint8_t  RESERVED17[2];
    __IO     uint16_t   CR2IC;                         /*!< RTC Control 2 for Configuring Input Capture Channels */
    __I      uint8_t  RESERVED18[2];
    __IO     uint16_t   CR3OC;                         /*!< RTC Control 3 for Configuring Output Compare Channel */
    __I      uint8_t  RESERVED19[2];
    __IO     uint16_t   CR4OC;                         /*!< RTC Control 4 for Configuring Output Compare Channel */
    __I      uint8_t  RESERVED20[2];
    __IO     uint16_t   OCMSK;                         /*!< RTC Masks for Output Compare Channel */
    __I      uint8_t  RESERVED21[2];
    __IO     uint16_t   OC1ARL;                        /*!< RTC Auto-Reload for Output Compare Channel 1 */
    __I      uint8_t  RESERVED22[6];
    __I      uint16_t   IC2;                           /*!< RTC Input Capture Channel 2 */
    __I      uint8_t  RESERVED23[2];
    __I      uint16_t   IC3;                           /*!< RTC Input Capture Channel 3 */
    __I      uint8_t  RESERVED24[2];
    __I      uint16_t   IC4;                           /*!< RTC Input Capture Channel 4 */
    __I      uint8_t  RESERVED25[2];
    __IO     uint16_t   OC1;                           /*!< RTC Output Compare Channel 1 */
    __I      uint8_t  RESERVED26[14];
    __I      uint16_t   SR4;                           /*!< RTC Status 4 */
    __I      uint8_t  RESERVED27[2];
    __I      uint16_t   SR5;                           /*!< RTC Status 5 */
    __I      uint8_t  RESERVED28[2];
    __I      uint16_t   SR6;                           /*!< RTC Status 6 */
    __I      uint8_t  RESERVED29[2];
    __I      uint16_t   OC1TGT;                        /*!< RTC Output Compare Channel 1 Target */
    __I      uint8_t  RESERVED30[2];
    __I      uint16_t   FRZCNT;                        /*!< RTC Freeze Count */
} ADI_RTC_TypeDef;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RTC_TypeDef__ */

