analogdevicesinc/aducm355-examples/inc/ADuCM355_device.h
/*!@}*/

/** @defgroup SYS System Identification and Debug Enable (SYS) Module
 *  System Identification and Debug Enable
 *  @{
 */

/*! ==========================================================================
 *  \struct ADI_SYS_TypeDef
 *  \brief  System Identification and Debug Enable
 *  ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_SYS_TypeDef__
typedef struct _ADI_SYS_TypeDef
{
    __I      uint8_t  RESERVED0[32];
    __I      uint16_t   ADIID;                         /*!< ADI Identification */
    __I      uint8_t  RESERVED1[2];
    __I      uint16_t   CHIPID;                        /*!< Chip Identifier */
    __I      uint8_t  RESERVED2[26];
    __O      uint16_t   SWDEN;                         /*!< Serial Wire Debug Enable */
} ADI_SYS_TypeDef;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_SYS_TypeDef__ */

/*!@}*/

/** @defgroup WDT Watchdog Timer (WDT) Module
 *  Watchdog Timer
 *  @{
 */

/*! ==========================================================================
 *  \struct ADI_WDT_TypeDef
 *  \brief  Watchdog Timer
 *  ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_WDT_TypeDef__
typedef struct _ADI_WDT_TypeDef
{
    __IO     int16_t    LOAD;                          /*!< Load value */
    __I      uint8_t  RESERVED0[2];
    __I      int16_t    CCNT;                          /*!< Current count value */
    __I      uint8_t  RESERVED1[2];
    __IO     uint16_t   CTL;                           /*!< Control */
    __I      uint8_t  RESERVED2[2];
    __O      int16_t    RESTART;                       /*!< Clear interrupt */
    __I      uint8_t  RESERVED3[10];
    __I      uint16_t   STAT;                          /*!< Status */
} ADI_WDT_TypeDef;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_WDT_TypeDef__ */

/*!@}*/

/** @defgroup I2C I2C Master/Slave (I2C) Module
 *  I2C Master/Slave
 *  @{
 */

/*! ==========================================================================
 *  \struct ADI_I2C_TypeDef
 *  \brief  I2C Master/Slave
 *  ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_I2C_TypeDef__
typedef struct _ADI_I2C_TypeDef
{
    __IO     uint16_t   MCTL;                          /*!< Master control */
    __I      uint8_t  RESERVED0[2];
    __IO     uint16_t   MSTAT;                         /*!< Master status */
    __I      uint8_t  RESERVED1[2];
    __I      uint16_t   MRX;                           /*!< Master receive data */
    __I      uint8_t  RESERVED2[2];
    __IO     uint16_t   MTX;                           /*!< Master transmit data */
    __I      uint8_t  RESERVED3[2];
    __IO     uint16_t   MRXCNT;                        /*!< Master receive data count */
    __I      uint8_t  RESERVED4[2];
    __I      uint16_t   MCRXCNT;                       /*!< Master current receive data count */
    __I      uint8_t  RESERVED5[2];
    __IO     uint16_t   ADDR1;                         /*!< 1st master address byte */
    __I      uint8_t  RESERVED6[2];
    __IO     uint16_t   ADDR2;                         /*!< 2nd master address byte */
    __I      uint8_t  RESERVED7[2];
    __IO     uint16_t   BYT;                           /*!< Start byte */
    __I      uint8_t  RESERVED8[2];
    __IO     uint16_t   DIV;                           /*!< Serial clock period divisor */
    __I      uint8_t  RESERVED9[2];
    __IO     uint16_t   SCTL;                          /*!< Slave control */
    __I      uint8_t  RESERVED10[2];
    __IO     uint16_t   SSTAT;                         /*!< Slave I2C Status/Error/IRQ */
    __I      uint8_t  RESERVED11[2];
    __I      uint16_t   SRX;                           /*!< Slave receive */
    __I      uint8_t  RESERVED12[2];
    __IO     uint16_t   STX;                           /*!< Slave transmit */
    __I      uint8_t  RESERVED13[2];
    __IO     uint16_t   ALT;                           /*!< Hardware general call ID */
    __I      uint8_t  RESERVED14[2];
    __IO     uint16_t   ID0;                           /*!< 1st slave address device ID */
    __I      uint8_t  RESERVED15[2];
    __IO     uint16_t   ID1;                           /*!< 2nd slave address device ID */
    __I      uint8_t  RESERVED16[2];
    __IO     uint16_t   ID2;                           /*!< 3rd slave address device ID */
    __I      uint8_t  RESERVED17[2];
    __IO     uint16_t   ID3;                           /*!< 4th slave address device ID */
    __I      uint8_t  RESERVED18[2];
    __IO     uint16_t   STAT;                          /*!< Master and slave FIFO status */
    __I      uint8_t  RESERVED19[2];
    __O      uint16_t   SHCTL;                         /*!< Shared control */
    __I      uint8_t  RESERVED20[2];
    __IO     uint16_t   TCTL;                          /*!< Timing Control Register */
    __I      uint8_t  RESERVED21[2];
    __IO     uint16_t   ASTRETCH_SCL;                  /*!< Automatic stretch SCL register */
} ADI_I2C_TypeDef;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_I2C_TypeDef__ */

/*!@}*/

/** @defgroup SPI Serial Peripheral Interface (SPI) Module
 *  Serial Peripheral Interface
 *  @{
 */

/*! ==========================================================================
 *  \struct ADI_SPI_TypeDef
 *  \brief  Serial Peripheral Interface
 *  ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_SPI_TypeDef__
typedef struct _ADI_SPI_TypeDef
{
    __IO     uint16_t   STAT;                          /*!< Status */
    __I      uint8_t  RESERVED0[2];
    __I      uint16_t   RX;                            /*!< Receive */
    __I      uint8_t  RESERVED1[2];
    __O      uint16_t   TX;                            /*!< Transmit */
    __I      uint8_t  RESERVED2[2];
    __IO     uint16_t   DIV;                           /*!< SPI baud rate selection */
    __I      uint8_t  RESERVED3[2];
    __IO     uint16_t   CTL;                           /*!< SPI configuration 1 */
    __I      uint8_t  RESERVED4[2];
    __IO     uint16_t   IEN;                           /*!< SPI configuration 2 */
    __I      uint8_t  RESERVED5[2];
    __IO     uint16_t   CNT;                           /*!< Transfer byte count */
    __I      uint8_t  RESERVED6[2];
    __IO     uint16_t   DMA;                           /*!< SPI DMA enable */
    __I      uint8_t  RESERVED7[2];
    __I      uint16_t   FIFO_STAT;                     /*!< FIFO Status */
    __I      uint8_t  RESERVED8[2];
    __IO     uint16_t   RD_CTL;                        /*!< Read Control */
    __I      uint8_t  RESERVED9[2];
    __IO     uint16_t   FLOW_CTL;                      /*!< Flow Control */
    __I      uint8_t  RESERVED10[2];
    __IO     uint16_t   WAIT_TMR;                      /*!< Wait timer for flow control */
    __I      uint8_t  RESERVED11[2];
    __IO     uint16_t   CS_CTL;                        /*!< Chip-Select control for multi-slave connections */
    __I      uint8_t  RESERVED12[2];
    __IO     uint16_t   CS_OVERRIDE;                   /*!< Chip-Select Override */
    __I      uint8_t  RESERVED13[4];
} ADI_SPI_TypeDef;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_SPI_TypeDef__ */

