analogdevicesinc/aducm355-examples/inc/ADuCM355_device.h
/*!@}*/

/** @defgroup UART  (UART) Module
 *  
 *  @{
 */

/*! ==========================================================================
 *  \struct ADI_UART_TypeDef
 *  \brief  
 *  ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_UART_TypeDef__
typedef struct _ADI_UART_TypeDef
{
    union {
    __I      uint16_t   COMRX;                         /*!< Receive Buffer Register */
    __O      uint16_t   COMTX;                         /*!< Transmit Holding Register */
    };
    __I      uint8_t  RESERVED0[2];
    __IO     uint16_t   COMIEN;                        /*!< Interrupt Enable */
    __I      uint8_t  RESERVED1[2];
    __I      uint16_t   COMIIR;                        /*!< Interrupt ID */
    __I      uint8_t  RESERVED2[2];
    __IO     uint16_t   COMLCR;                        /*!< Line Control */
    __I      uint8_t  RESERVED3[2];
    __IO     uint16_t   COMMCR;                        /*!< Modem Control */
    __I      uint8_t  RESERVED4[2];
    __I      uint16_t   COMLSR;                        /*!< Line Status */
    __I      uint8_t  RESERVED5[2];
    __I      uint16_t   COMMSR;                        /*!< Modem Status */
    __I      uint8_t  RESERVED6[2];
    __IO     uint16_t   COMSCR;                        /*!< Scratch buffer */
    __I      uint8_t  RESERVED7[2];
    __IO     uint16_t   COMFCR;                        /*!< FIFO Control */
    __I      uint8_t  RESERVED8[2];
    __IO     uint16_t   COMFBR;                        /*!< Fractional Baud Rate */
    __I      uint8_t  RESERVED9[2];
    __IO     int16_t    COMDIV;                        /*!< Baudrate divider */
    __I      uint8_t  RESERVED10[2];
    __IO     uint16_t   COMLCR2;                       /*!< second Line Control */
    __I      uint8_t  RESERVED11[2];
    __IO     uint16_t   COMCTL;                        /*!< UART control register */
    __I      uint8_t  RESERVED12[2];
    __I      uint16_t   COMRFC;                        /*!< RX FIFO byte count */
    __I      uint8_t  RESERVED13[2];
    __I      uint16_t   COMTFC;                        /*!< TX FIFO byte count */
    __I      uint8_t  RESERVED14[2];
    __IO     uint16_t   COMRSC;                        /*!< RS485 half-duplex Control */
    __I      uint8_t  RESERVED15[2];
    __IO     uint16_t   COMACR;                        /*!< Auto Baud Control */
    __I      uint8_t  RESERVED16[2];
    __I      uint16_t   COMASRL;                       /*!< Auto Baud Status (Low) */
    __I      uint8_t  RESERVED17[2];
    __I      uint16_t   COMASRH;                       /*!< Auto Baud Status (High) */
} ADI_UART_TypeDef;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_UART_TypeDef__ */

/*!@}*/

/** @defgroup DMA DMA (DMA) Module
 *  DMA
 *  @{
 */

/*! ==========================================================================
 *  \struct ADI_DMA_TypeDef
 *  \brief  DMA
 *  ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_DMA_TypeDef__
typedef struct _ADI_DMA_TypeDef
{
    __I      uint32_t   STAT;                          /*!< DMA Status */
    __O      uint32_t   CFG;                           /*!< DMA Configuration */
    __IO     int32_t    PDBPTR;                        /*!< DMA channel primary control data base pointer */
    __I      int32_t    ADBPTR;                        /*!< DMA channel alternate control data base pointer */
    __I      uint8_t  RESERVED0[4];
    __O      uint32_t   SWREQ;                         /*!< DMA channel software request */
    __I      uint8_t  RESERVED1[8];
    __IO     uint32_t   RMSK_SET;                      /*!< DMA channel request mask set */
    __O      uint32_t   RMSK_CLR;                      /*!< DMA channel request mask clear */
    __IO     uint32_t   EN_SET;                        /*!< DMA channel enable set */
    __O      uint32_t   EN_CLR;                        /*!< DMA channel enable clear */
    __IO     uint32_t   ALT_SET;                       /*!< DMA channel primary-alternate set */
    __O      uint32_t   ALT_CLR;                       /*!< DMA channel primary-alternate clear */
    __O      uint32_t   PRI_SET;                       /*!< DMA channel priority set */
    __O      uint32_t   PRI_CLR;                       /*!< DMA channel priority clear */
    __I      uint8_t  RESERVED2[8];
    __IO     uint32_t   ERRCHNL_CLR;                   /*!< DMA Per Channel Error Clear */
    __IO     uint32_t   ERR_CLR;                       /*!< DMA bus error clear */
    __IO     uint32_t   INVALIDDESC_CLR;               /*!< DMA Per Channel Invalid Descriptor Clear */
    __I      uint8_t  RESERVED3[1964];
    __IO     uint32_t   BS_SET;                        /*!< DMA channel bytes swap enable set */
    __O      uint32_t   BS_CLR;                        /*!< DMA channel bytes swap enable clear */
    __I      uint8_t  RESERVED4[8];
    __IO     uint32_t   SRCADDR_SET;                   /*!< DMA channel source address decrement enable set */
    __O      uint32_t   SRCADDR_CLR;                   /*!< DMA channel source address decrement enable clear */
    __IO     uint32_t   DSTADDR_SET;                   /*!< DMA channel destination address decrement enable set */
    __O      uint32_t   DSTADDR_CLR;                   /*!< DMA channel destination address decrement enable clear */
    __I      uint8_t  RESERVED5[1984];
    __I      uint32_t   REVID;                         /*!< DMA Controller Revision ID */
} ADI_DMA_TypeDef;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_DMA_TypeDef__ */

/*!@}*/

/** @defgroup FLCC Flash Controller (FLCC) Module
 *  Flash Controller
 *  @{
 */

/*! ==========================================================================
 *  \struct ADI_FLCC_TypeDef
 *  \brief  Flash Controller
 *  ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_FLCC_TypeDef__
typedef struct _ADI_FLCC_TypeDef
{
    __IO     uint32_t   STAT;                          /*!< Status */
    __IO     uint32_t   IEN;                           /*!< Interrupt Enable */
    __IO     uint32_t   CMD;                           /*!< Command */
    __IO     uint32_t   KH_ADDR;                       /*!< WRITE Address */
    __IO     int32_t    KH_DATA0;                      /*!< WRITE Lower Data */
    __IO     int32_t    KH_DATA1;                      /*!< WRITE Upper Data */
    __IO     uint32_t   PAGE_ADDR0;                    /*!< Lower Page Address */
    __IO     uint32_t   PAGE_ADDR1;                    /*!< Upper Page Address */
    __O      int32_t    KEY;                           /*!< Key */
    __I      int32_t    WR_ABORT_ADDR;                 /*!< Write Abort Address */
    __IO     int32_t    WRPROT;                        /*!< Write Protection */
    __I      int32_t    SIGNATURE;                     /*!< Signature */
    __IO     uint32_t   UCFG;                          /*!< User Configuration */
    __IO     uint32_t   TIME_PARAM0;                   /*!< Time Parameter 0 */
    __IO     uint32_t   TIME_PARAM1;                   /*!< Time parameter 1 */
    __IO     uint32_t   ABORT_EN_LO;                   /*!< IRQ Abort Enable (lower bits) */
    __IO     uint32_t   ABORT_EN_HI;                   /*!< IRQ Abort Enable (upper bits) */
    __IO     uint32_t   ECC_CFG;                       /*!< ECC Config */
    __I      uint32_t   ECC_ADDR;                      /*!< ECC Status (Address) */
    __I      uint8_t  RESERVED0[4];
    __IO     uint32_t   ADI_POR_SEC;                   /*!< ADI flash security */
    __I      uint8_t  RESERVED1[4];
} ADI_FLCC_TypeDef;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_FLCC_TypeDef__ */

