analogdevicesinc/aducm355-examples/inc/ADuCM355_device.h
/*!@}*/

/** @defgroup FLCC_CACHE Cache Controller (FLCC_CACHE) Module
 *  Cache Controller
 *  @{
 */

/*! ==========================================================================
 *  \struct ADI_FLCC_CACHE_TypeDef
 *  \brief  Cache Controller
 *  ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_FLCC_CACHE_TypeDef__
typedef struct _ADI_FLCC_CACHE_TypeDef
{
    __I      uint32_t   STAT;                          /*!< Cache Status register */
    __IO     uint32_t   SETUP;                         /*!< Cache Setup register */
    __O      int32_t    KEY;                           /*!< Cache Key register */
    __I      uint8_t  RESERVED0[40];
} ADI_FLCC_CACHE_TypeDef;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_FLCC_CACHE_TypeDef__ */

/*!@}*/

/** @defgroup GPIO  (GPIO) Module
 *  
 *  @{
 */

/*! ==========================================================================
 *  \struct ADI_GPIO_TypeDef
 *  \brief  
 *  ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_GPIO_TypeDef__
typedef struct _ADI_GPIO_TypeDef
{
    __IO     uint32_t   CFG;                           /*!< Port  Configuration */
    __IO     uint16_t   OEN;                           /*!< Port output enable */
    __I      uint8_t  RESERVED0[2];
    __IO     uint16_t   PE;                            /*!< Port output pullup/pulldown enable */
    __I      uint8_t  RESERVED1[2];
    __IO     uint16_t   IEN;                           /*!< Port  Input Path Enable */
    __I      uint8_t  RESERVED2[2];
    __I      uint16_t   IN;                            /*!< Port  registered data input */
    __I      uint8_t  RESERVED3[2];
    __IO     uint16_t   OUT;                           /*!< Port data output */
    __I      uint8_t  RESERVED4[2];
    __O      uint16_t   SET;                           /*!< Port data out set */
    __I      uint8_t  RESERVED5[2];
    __O      uint16_t   CLR;                           /*!< Port Data Out Clear */
    __I      uint8_t  RESERVED6[2];
    __O      uint16_t   TGL;                           /*!< Port Pin Toggle */
    __I      uint8_t  RESERVED7[2];
    __IO     uint16_t   POL;                           /*!< Port Interrupt Polarity */
    __I      uint8_t  RESERVED8[2];
    __IO     uint16_t   IENA;                          /*!< Port Interrupt A Enable */
    __I      uint8_t  RESERVED9[2];
    __IO     uint16_t   IENB;                          /*!< Port Interrupt B Enable */
    __I      uint8_t  RESERVED10[2];
    __IO     uint16_t   INT;                           /*!< Port Interrupt Status */
    __I      uint8_t  RESERVED11[2];
    __IO     uint16_t   DS;                            /*!< Port Drive Strength Select */
} ADI_GPIO_TypeDef;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_GPIO_TypeDef__ */

/*!@}*/

/** @defgroup CRC CRC Accelerator (CRC) Module
 *  CRC Accelerator
 *  @{
 */

/*! ==========================================================================
 *  \struct ADI_CRC_TypeDef
 *  \brief  CRC Accelerator
 *  ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_CRC_TypeDef__
typedef struct _ADI_CRC_TypeDef
{
    __IO     uint32_t   CTL;                           /*!< CRC Control Register */
    __O      int32_t    IPDATA;                        /*!< Input Data Word Register */
    __IO     int32_t    RESULT;                        /*!< CRC Result Register */
    __IO     uint32_t   POLY;                          /*!< Programmable CRC Polynomial */
    union {
    __O      uint8_t    IPBITS[8];                     /*!< Input Data Bits */
    __O      uint8_t    IPBYTE;                        /*!< Input Data Byte */
    };
} ADI_CRC_TypeDef;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_CRC_TypeDef__ */

/*!@}*/

/** @defgroup RNG Random Number Generator (RNG) Module
 *  Random Number Generator
 *  @{
 */

/*! ==========================================================================
 *  \struct ADI_RNG_TypeDef
 *  \brief  Random Number Generator
 *  ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_RNG_TypeDef__
typedef struct _ADI_RNG_TypeDef
{
    __IO     uint16_t   CTL;                           /*!< RNG Control Register */
    __I      uint8_t  RESERVED0[2];
    __IO     uint16_t   LEN;                           /*!< RNG Sample Length Register */
    __I      uint8_t  RESERVED1[2];
    __IO     uint16_t   STAT;                          /*!< RNG Status Register */
    __I      uint8_t  RESERVED2[2];
    __I      uint32_t   DATA;                          /*!< RNG Data Register */
    __I      uint32_t   OSCCNT;                        /*!< Oscillator Count */
    __I      int8_t     OSCDIFF[4];                    /*!< Oscillator Difference */
} ADI_RNG_TypeDef;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_RNG_TypeDef__ */

/*!@}*/

/** @defgroup CRYPT Cryptogaphic (CRYPT) Module
 *  Cryptogaphic
 *  @{
 */

/*! ==========================================================================
 *  \struct ADI_CRYPT_TypeDef
 *  \brief  Cryptogaphic
 *  ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_CRYPT_TypeDef__
typedef struct _ADI_CRYPT_TypeDef
{
    __IO     uint32_t   CFG;                           /*!< Configuration Register */
    __IO     uint32_t   DATALEN;                       /*!< Payload Data Length */
    __IO     uint32_t   PREFIXLEN;                     /*!< Authentication Data Length */
    __IO     uint32_t   INTEN;                         /*!< Interrupt Enable Register */
    __IO     uint32_t   STAT;                          /*!< Status Register */
    __O      int32_t    INBUF;                         /*!< Input Buffer */
    __I      int32_t    OUTBUF;                        /*!< Output Buffer */
    __IO     uint32_t   NONCE0;                        /*!< Nonce Bits [31:0] */
    __IO     uint32_t   NONCE1;                        /*!< Nonce Bits [63:32] */
    __IO     uint32_t   NONCE2;                        /*!< Nonce Bits [95:64] */
    __IO     uint32_t   NONCE3;                        /*!< Nonce Bits [127:96] */
    __O      uint32_t   AESKEY0;                       /*!< Key Bits[ 31:0 ] */
    __O      uint32_t   AESKEY1;                       /*!< Key Bits [ 63:32 ] */
    __O      uint32_t   AESKEY2;                       /*!< Key Bits [ 95:64 ] */
    __O      uint32_t   AESKEY3;                       /*!< Key Bits [ 127:96 ] */
    __O      uint32_t   AESKEY4;                       /*!< Key Bits [ 159:128 ] */
    __O      uint32_t   AESKEY5;                       /*!< Key Bits [ 191:160 ] */
    __O      uint32_t   AESKEY6;                       /*!< Key Bits [ 223:192 ] */
    __O      uint32_t   AESKEY7;                       /*!< Key Bits [ 255:224 ] */
    __IO     uint32_t   CNTRINIT;                      /*!< Counter Initialization Vector */
    __IO     uint32_t   SHAH0;                         /*!< SHA Bits [ 31:0 ] */
    __IO     uint32_t   SHAH1;                         /*!< SHA Bits [ 63:32 ] */
    __IO     uint32_t   SHAH2;                         /*!< SHA Bits [ 95:64 ] */
    __IO     uint32_t   SHAH3;                         /*!< SHA Bits [ 127:96 ] */
    __IO     uint32_t   SHAH4;                         /*!< SHA Bits [ 159:128 ] */
    __IO     uint32_t   SHAH5;                         /*!< SHA Bits [ 191:160 ] */
    __IO     uint32_t   SHAH6;                         /*!< SHA Bits [ 223:192] */
    __IO     uint32_t   SHAH7;                         /*!< SHA Bits [ 255:224 ] */
    __IO     uint32_t   SHA_LAST_WORD;                 /*!< SHA Last Word and Valid Bits Information */
    __IO     uint32_t   CCM_NUM_VALID_BYTES;           /*!< NUM_VALID_BYTES */
} ADI_CRYPT_TypeDef;
