analogdevicesinc/aducm355-examples/inc/ADuCM355_device.h
/*! ==========================================================================
 *  \struct ADI_AGPIO_TypeDef
 *  \brief  
 *  ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AGPIO_TypeDef__
typedef struct _ADI_AGPIO_TypeDef
{
    __IO     uint32_t   CON;                           /*!< GPIO Port Configuration */
    __IO     uint16_t   OEN;                           /*!< GPIO Port Output Enable */
    __I      uint8_t  RESERVED0[2];
    __IO     uint16_t   PE;                            /*!< GPIO Port Pullup/Pulldown Enable */
    __I      uint8_t  RESERVED1[2];
    __IO     uint16_t   IEN;                           /*!< GPIO Port Input Path Enable */
    __I      uint8_t  RESERVED2[2];
    __I      uint16_t   IN;                            /*!< GPIO Port Registered Data Input */
    __I      uint8_t  RESERVED3[2];
    __IO     uint16_t   OUT;                           /*!< GPIO Port Data Output */
    __I      uint8_t  RESERVED4[2];
    __O      uint16_t   SET;                           /*!< GPIO Port Data Out Set */
    __I      uint8_t  RESERVED5[2];
    __O      uint16_t   CLR;                           /*!< GPIO Port Data Out Clear */
    __I      uint8_t  RESERVED6[2];
    __O      uint16_t   TGL;                           /*!< GPIO Port Pin Toggle */
} ADI_AGPIO_TypeDef;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AGPIO_TypeDef__ */

/*!@}*/

/** @defgroup AFECON  (AFECON) Module
 *  
 *  @{
 */

/*! ==========================================================================
 *  \struct ADI_AFECON_TypeDef
 *  \brief  
 *  ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFECON_TypeDef__
typedef struct _ADI_AFECON_TypeDef
{
    __I      uint16_t   ADIID;                         /*!< ADI Identification */
    __I      uint8_t  RESERVED0[2];
    __I      uint16_t   CHIPID;                        /*!< Chip Identification */
    __I      uint8_t  RESERVED1[2];
    __IO     uint16_t   CLKCON0;                       /*!< Clock Divider Configuration */
    __I      uint8_t  RESERVED2[6];
    __IO     uint16_t   CLKEN1;                        /*!< Clock Gate Enable */
    __I      uint8_t  RESERVED3[2];
    __IO     uint16_t   CLKSEL;                        /*!< Clock Select */
    __I      uint8_t  RESERVED4[6];
    __IO     uint16_t   GPIOCLKMUXSEL;                 /*!< GPIO Clock MUX Select */
    __I      uint8_t  RESERVED5[2];
    __IO     uint16_t   CLKCON0KEY;                    /*!< Enable Clock Division to 8Mhz,4Mhz and 2Mhz */
    __I      uint8_t  RESERVED6[18];
    __O      uint16_t   MKEY;                          /*!< MKEY */
    __I      uint8_t  RESERVED7[2];
    __IO     uint16_t   DSPUPDATEEN;                   /*!< DSP Update Enable */
    __I      uint8_t  RESERVED8[4];
} ADI_AFECON_TypeDef;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFECON_TypeDef__ */

/*!@}*/

/** @defgroup AFEWDT  (AFEWDT) Module
 *  
 *  @{
 */

/*! ==========================================================================
 *  \struct ADI_AFEWDT_TypeDef
 *  \brief  
 *  ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFEWDT_TypeDef__
typedef struct _ADI_AFEWDT_TypeDef
{
    __IO     int16_t    WDTLD;                         /*!< Watchdog Timer Load Value */
    __I      uint8_t  RESERVED0[2];
    __I      int16_t    WDTVALS;                       /*!< Current Count Value */
    __I      uint8_t  RESERVED1[2];
    __IO     uint16_t   WDTCON;                        /*!< Watchdog Timer Control Register */
    __I      uint8_t  RESERVED2[2];
    __O      int16_t    WDTCLRI;                       /*!< Refresh Watchdog Register */
    __I      uint8_t  RESERVED3[10];
    __IO     uint16_t   WDTSTA;                        /*!< Timer Status */
    __I      uint8_t  RESERVED4[2];
    __IO     int16_t    WDTMINLD;                      /*!< Minimum Load Value */
} ADI_AFEWDT_TypeDef;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFEWDT_TypeDef__ */

/*!@}*/

/** @defgroup ALLON Always On Register (ALLON) Module
 *  Always On Register
 *  @{
 */

/*! ==========================================================================
 *  \struct ADI_ALLON_TypeDef
 *  \brief  Always On Register
 *  ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_ALLON_TypeDef__
typedef struct _ADI_ALLON_TypeDef
{
    __IO     uint16_t   PWRMOD;                        /*!< Power Modes */
    __I      uint8_t  RESERVED0[2];
    __IO     int16_t    PWRKEY;                        /*!< Key Protection for PWRMOD */
    __I      uint8_t  RESERVED1[6];
    __IO     int16_t    OSCKEY;                        /*!< Key Protection for OSCCON */
    __I      uint8_t  RESERVED2[2];
    __IO     uint16_t   OSCCON;                        /*!< Oscillator Control */
    __I      uint8_t  RESERVED3[22];
    __IO     uint16_t   EI2CON;                        /*!< External Interrupt Configuration 2 */
    __I      uint8_t  RESERVED4[6];
    __IO     uint16_t   EICLR;                         /*!< External Interrupt Clear */
    __I      uint8_t  RESERVED5[14];
    __IO     uint16_t   RSTSTA;                        /*!< Reset Status */
    __I      uint8_t  RESERVED6[2];
    __I      uint16_t   PMUSTA;                        /*!< PMU Status */
    __I      uint8_t  RESERVED7[42];
    __IO     uint16_t   CLKEN0;                        /*!< 32KHz Peripheral Clock Enable */
    __I      uint8_t  RESERVED8[12];
} ADI_ALLON_TypeDef;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_ALLON_TypeDef__ */

/*!@}*/

/** @defgroup AGPT0 General Purpose Timer (AGPT0) Module
 *  General Purpose Timer
 *  @{
 */

/*! ==========================================================================
 *  \struct ADI_AGPT0_TypeDef
 *  \brief  General Purpose Timer
 *  ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AGPT0_TypeDef__
typedef struct _ADI_AGPT0_TypeDef
{
    __IO     int16_t    LD0;                           /*!< 16-bit Load Value Register. */
    __I      uint8_t  RESERVED0[2];
    __I      int16_t    VAL0;                          /*!< 16-Bit Timer Value Register. */
    __I      uint8_t  RESERVED1[2];
    __IO     uint16_t   CON0;                          /*!< Control Register. */
    __I      uint8_t  RESERVED2[2];
    __O      uint16_t   CLRI0;                         /*!< Clear Interrupt Register. */
    __I      uint8_t  RESERVED3[2];
    __I      int16_t    CAP0;                          /*!< Capture Register. */
    __I      uint8_t  RESERVED4[2];
    __IO     int16_t    ALD0;                          /*!< 16-Bit Load Value, Asynchronous. */
    __I      uint8_t  RESERVED5[2];
    __I      int16_t    AVAL0;                         /*!< 16-Bit Timer Value, Asynchronous Register. */
    __I      uint8_t  RESERVED6[2];
    __I      uint16_t   STA0;                          /*!< Status Register. */
    __I      uint8_t  RESERVED7[2];
    __IO     uint16_t   PWMCON0;                       /*!< PWM Control Register. */
    __I      uint8_t  RESERVED8[2];
    __IO     int16_t    PWMMAT0;                       /*!< PWM Match Value Register. */
    __I      uint8_t  RESERVED9[2];
    __IO     uint16_t   INTEN;                         /*!< Interrupt Enable */
} ADI_AGPT0_TypeDef;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AGPT0_TypeDef__ */

