analogdevicesinc/aducm355-examples/inc/ADuCM355_device.h
/*!@}*/

/** @defgroup AGPT1 General Purpose Timer (AGPT1) Module
 *  General Purpose Timer
 *  @{
 */

/*! ==========================================================================
 *  \struct ADI_AGPT1_TypeDef
 *  \brief  General Purpose Timer
 *  ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AGPT1_TypeDef__
typedef struct _ADI_AGPT1_TypeDef
{
    __IO     int16_t    LD1;                           /*!< 16-bit Load Value Register */
    __I      uint8_t  RESERVED0[2];
    __I      int16_t    VAL1;                          /*!< 16-bit Timer Value Register */
    __I      uint8_t  RESERVED1[2];
    __IO     uint16_t   CON1;                          /*!< Control Register */
    __I      uint8_t  RESERVED2[2];
    __O      uint16_t   CLRI1;                         /*!< Clear Interrupt Register */
    __I      uint8_t  RESERVED3[2];
    __I      int16_t    CAP1;                          /*!< Capture Register */
    __I      uint8_t  RESERVED4[2];
    __IO     int16_t    ALD1;                          /*!< 16-bit Load Value, Asynchronous Register */
    __I      uint8_t  RESERVED5[2];
    __I      int16_t    AVAL1;                         /*!< 16-bit Timer Value, Asynchronous Register */
    __I      uint8_t  RESERVED6[2];
    __I      uint16_t   STA1;                          /*!< Status Register */
    __I      uint8_t  RESERVED7[2];
    __IO     uint16_t   PWMCON1;                       /*!< PWM Control Register */
    __I      uint8_t  RESERVED8[2];
    __IO     int16_t    PWMMAT1;                       /*!< PWM Match Value Register */
    __I      uint8_t  RESERVED9[2];
    __IO     uint16_t   INTEN1;                        /*!< Interrupt Enable */
} ADI_AGPT1_TypeDef;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AGPT1_TypeDef__ */

/*!@}*/

/** @defgroup AFECRC CRC Accelerator (AFECRC) Module
 *  CRC Accelerator
 *  @{
 */

/*! ==========================================================================
 *  \struct ADI_AFECRC_TypeDef
 *  \brief  CRC Accelerator
 *  ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFECRC_TypeDef__
typedef struct _ADI_AFECRC_TypeDef
{
    __IO     uint32_t   CTL;                           /*!< CRC Control Register */
    __O      int32_t    IPDATA;                        /*!< Data Input. */
    __IO     int32_t    RESULT;                        /*!< CRC Residue */
    __IO     uint32_t   POLY;                          /*!< CRC Reduction Polynomial */
    __O      uint8_t    IPBITS;                        /*!< Input Data Bits */
    __I      uint8_t  RESERVED0[3];
    __O      uint8_t    IPBYTE;                        /*!< Input Data Byte */
    __I      uint8_t  RESERVED1[11];
    __IO     uint32_t   CRC_SIG_COMP;                  /*!< CRC Signature Compare Data Input. */
    __IO     uint32_t   CRCINTEN;                      /*!< CRC Error Interrupt Enable Bit */
    __IO     uint32_t   INTSTA;                        /*!< CRC Error Interrupt Status Bit */
} ADI_AFECRC_TypeDef;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFECRC_TypeDef__ */

/*!@}*/

/** @defgroup AFE  (AFE) Module
 *  
 *  @{
 */

/*! ==========================================================================
 *  \struct ADI_AFE_TypeDef
 *  \brief  
 *  ========================================================================== */
#ifndef __ADI_NO_DECL_STRUCT_ADI_AFE_TypeDef__
typedef struct _ADI_AFE_TypeDef
{
    __IO     uint32_t   AFECON;                        /*!< AFE Configuration */
    __I      uint8_t  RESERVED0[8];
    __IO     uint32_t   SWCON;                         /*!< Switch Matrix Configuration */
    __IO     uint32_t   HSDACCON;                      /*!< High Speed DAC Configuration */
    __IO     uint32_t   WGCON;                         /*!< Waveform Generator Configuration */
    __I      uint8_t  RESERVED1[24];
    __IO     uint32_t   WGFCW;                         /*!< Waveform Generator - Sinusoid Frequency Control Word */
    __IO     uint32_t   WGPHASE;                       /*!< Waveform Generator - Sinusoid Phase Offset */
    __IO     uint32_t   WGOFFSET;                      /*!< Waveform Generator - Sinusoid Offset */
    __IO     uint32_t   WGAMPLITUDE;                   /*!< Waveform Generator - Sinusoid Amplitude */
    __I      uint8_t  RESERVED2[4];
    __IO     uint32_t   ADCFILTERCON;                  /*!< ADC Output Filters Configuration */
    __IO     uint32_t   HSDACDAT;                      /*!< HS DAC Code */
    __I      uint8_t  RESERVED3[4];
    __IO     uint32_t   LPREFBUFCON;                   /*!< LPREF_BUF_CON */
    __I      uint8_t  RESERVED4[32];
    __IO     uint32_t   ADCDAT;                        /*!< ADC Raw Result */
    __IO     uint32_t   DFTREAL;                       /*!< DFT Result, Real Part */
    __IO     uint32_t   DFTIMAG;                       /*!< DFT Result, Imaginary Part */
    __IO     uint32_t   SINC2DAT;                      /*!< Supply Rejection Filter Result */
    __IO     uint32_t   TEMPSENSDAT;                   /*!< Temperature Sensor Result */
    __IO     uint32_t   ADCINTIEN;                     /*!< ADC Interrupt Enable Register */
    __I      uint8_t  RESERVED5[12];
    __IO     uint32_t   ADCINTSTA;                     /*!< ADC Interrupt Status */
    __IO     uint32_t   AFEGENINTSTA;                  /*!< Analog Generation Interrupt */
    __I      uint8_t  RESERVED6[8];
    __IO     uint32_t   ADCMIN;                        /*!< ADC Minimum Value Check */
    __IO     uint32_t   ADCMINSM;                      /*!< ADCMIN Hysteresis Value */
    __IO     uint32_t   ADCMAX;                        /*!< ADC Maximum Value Check */
    __IO     uint32_t   ADCMAXSMEN;                    /*!< ADCMAX Hysteresis Value */
    __IO     uint32_t   ADCDELTA;                      /*!< ADC Delta Value */
    __IO     uint32_t   HPOSCCON;                      /*!< HPOSC Configuration */
    __I      uint8_t  RESERVED7[16];
    __IO     uint32_t   DFTCON;                        /*!< AFE DSP Configuration */
    __I      uint8_t  RESERVED8[12];
    __IO     uint32_t   LPTIASW1;                      /*!< ULPTIA Switch Configuration for Channel 1 */
    __IO     uint32_t   LPTIASW0;                      /*!< ULPTIA Switch Configuration for Channel 0 */
    __IO     uint32_t   LPTIACON1;                     /*!< ULPTIA Control Bits Channel 1 */
    __IO     uint32_t   LPTIACON0;                     /*!< ULPTIA Control Bits Channel 0 */
    __IO     uint32_t   HSRTIACON;                     /*!< High Power RTIA Configuration */
    __IO     uint32_t   DE1RESCON;                     /*!< DE1 HSTIA Resistors Configuration */
    __IO     uint32_t   DE0RESCON;                     /*!< DE0 HSTIA Resistors Configuration */
    __IO     uint32_t   HSTIACON;                      /*!< HSTIA Amplifier Configuration */
    __I      uint8_t  RESERVED9[4];
    __IO     uint32_t   DACDCBUFCON;                   /*!< DAC DC Buffer Configuration */
    __I      uint8_t  RESERVED10[24];
    __IO     uint32_t   LPDACDAT0;                     /*!< LPDAC Data-out */
    __IO     uint32_t   LPDACSW0;                      /*!< LPDAC0 Switch Control */
    __IO     uint32_t   LPDACCON0;                     /*!< LPDAC Control Bits */
    __IO     uint32_t   LPDACDAT1;                     /*!< Low Power DAC1 data register */
    __IO     uint32_t   LPDACSW1;                      /*!< Control register for switches to LPDAC1 */
    __IO     uint32_t   LPDACCON1;                     /*!< ULP_DACCON1 */
    __I      uint8_t  RESERVED11[24];
    __IO     uint32_t   DSWFULLCON;                    /*!< Switch Matrix Full Configuration (D) */
    __IO     uint32_t   NSWFULLCON;                    /*!< Switch Matrix Full Configuration (N) */
    __IO     uint32_t   PSWFULLCON;                    /*!< Switch Matrix Full Configuration (P) */
    __IO     uint32_t   TSWFULLCON;                    /*!< Switch Matrix Full Configuration (T) */
    __I      uint8_t  RESERVED12[20];
    __IO     uint32_t   TEMPCON0;                      /*!< Temp Sensor Configuration */
    __I      uint8_t  RESERVED13[8];
    __IO     uint32_t   BUFSENCON;                     /*!< HP and LP Buffer Control */
    __I      uint8_t  RESERVED14[36];
    __IO     uint32_t   ADCCON;                        /*!< ADC Configuration */
    __I      uint8_t  RESERVED15[4];
    __I      uint32_t   DSWSTA;                        /*!< Switch Matrix Status (D) */
    __I      uint32_t   PSWSTA;                        /*!< Switch Matrix Status (P) */
    __I      uint32_t   NSWSTA;                        /*!< Switch Matrix Status (N) */
    __I      uint32_t   TSWSTA;                        /*!< Switch Matrix Status (T) */
    __I      uint32_t   STATSVAR;                      /*!< Variance Output */
    __IO     uint32_t   STATSCON;                      /*!< Statistics Control */
    __I      uint32_t   STATSMEAN;                     /*!< Statistics Mean Output */
    __I      uint8_t  RESERVED16[36];
    __IO     uint32_t   REPEATADCCNV;                  /*!< REPEAT ADC Conversions */
    __I      uint8_t  RESERVED17[60];
    __IO     uint32_t   CALDATLOCK;                    /*!< Calibration Data Lock */
    __IO     uint32_t   ADCOFFSETHSTIA;                /*!< ADC Offset Calibration High Speed TIA Channel */
    __IO     uint32_t   ADCGAINTEMPSENS0;              /*!< ADC Gain Calibration Temp Sensor Channel */
    __IO     uint32_t   ADCOFFSETTEMPSENS0;            /*!< ADC Offset Calibration Temp Sensor Channel 0 */
    __IO     uint32_t   ADCGAINGN1;                    /*!< ADCPGAGN1: ADC Gain Calibration Auxiliary Input Channel */
    __IO     uint32_t   ADCOFFSETGN1;                  /*!< ADC Offset Calibration Auxiliary Channel (PGA Gain=1) */
    __I      uint8_t  RESERVED18[24];
    __IO     uint32_t   DACGAIN;                       /*!< DACGAIN */
    __IO     uint32_t   DACOFFSETATTEN;                /*!< DAC Offset with Attenuator Enabled (LP Mode) */
    __IO     uint32_t   DACOFFSET;                     /*!< DAC Offset with Attenuator Disabled (LP Mode) */
    __I      uint8_t  RESERVED19[4];
    __IO     uint32_t   ADCGAINGN1P5;                  /*!< ADC Gain Calibration Auxiliary Input Channel (PGA Gain=1.5) */
    __IO     uint32_t   ADCGAINGN2;                    /*!< ADC Gain Calibration Auxiliary Input Channel (PGA Gain=2) */
    __IO     uint32_t   ADCGAINGN4;                    /*!< ADC Gain Calibration Auxiliary Input Channel (PGA Gain=4) */
    __I      uint8_t  RESERVED20[4];
    __IO     uint32_t   ADCPGAOFFSETCANCEL;            /*!< ADC Offset Cancellation (Optional) */
    __IO     uint32_t   ADCGNHSTIA;                    /*!< ADC Gain Calibration for HS TIA Channel */
    __IO     uint32_t   ADCOFFSETLPTIA0;               /*!< ADC Offset Calibration ULP-TIA0 Channel */
    __IO     uint32_t   ADCGNLPTIA0;                   /*!< ADC GAIN Calibration for LP TIA0 Channel */
    __I      uint8_t  RESERVED21[4];
    __IO     uint32_t   ADCPGAGN4OFCAL;                /*!< ADC Gain Calibration with DC Cancellation(PGA G=4) */
    __IO     uint32_t   ADCGAINGN9;                    /*!< ADC Gain Calibration Auxiliary Input Channel (PGA Gain=9) */
    __I      uint8_t  RESERVED22[12];
    __IO     uint32_t   ADCOFFSETEMPSENS1;             /*!< ADC Offset Calibration  Temp Sensor Channel 1 */
    __IO     uint32_t   ADCGAINTEMPSENS1;              /*!< ADC Gain Calibration Temperature Sensor Channel */
    __I      uint8_t  RESERVED23[8];
    __IO     uint32_t   DACOFFSETATTENHP;              /*!< DAC Offset with Attenuator Enabled (HP Mode) */
    __IO     uint32_t   DACOFFSETHP;                   /*!< DAC Offset with Attenuator Disabled (HP Mode) */
    __IO     uint32_t   ADCOFFSETLPTIA1;               /*!< ADC Offset Calibration LP TIA1 Channel */
    __IO     uint32_t   ADCGNLPTIA1;                   /*!< ADC GAIN Calibration for LP TIA1 Channel */
    __IO     uint32_t   ADCOFFSETGN2;                  /*!< Offset Calibration Auxiliary Channel (PGA Gain =2) */
    __IO     uint32_t   ADCOFFSETGN1P5;                /*!< Offset Calibration Auxiliary Channel (PGA Gain =1.5) */
    __IO     uint32_t   ADCOFFSETGN9;                  /*!< Offset Calibration Auxiliary Channel (PGA Gain =9) */
    __IO     uint32_t   ADCOFFSETGN4;                  /*!< Offset Calibration Auxiliary Channel (PGA Gain =4) */
    __I      uint8_t  RESERVED24[24];
    __IO     uint32_t   PMBW;                          /*!< Power Mode Configuration */
    __I      uint8_t  RESERVED25[104];
    __IO     uint32_t   SWMUX;                         /*!< Switch Mux for ECG */
    __I      uint8_t  RESERVED26[20];
    __IO     uint32_t   TEMPCON1;                      /*!< AFE_TEMPSEN_DIO */
    __I      uint8_t  RESERVED27[16];
    __IO     uint32_t   TESTDAC;                       /*!< DAC Test */
    __IO     uint32_t   ADCBUFCON;                     /*!< Configure ADC Input Buffer */
    __I      uint8_t  RESERVED28[112];
} ADI_AFE_TypeDef;
#endif /* !__ADI_NO_DECL_STRUCT_ADI_AFE_TypeDef__ */

