analogdevicesinc/aducm355-examples/inc/ADuCM355_device.h
typedef enum
{
  RESET_IRQn                     =   -15,    /*!< Cortex-M3 Reset */
  NonMaskableInt_IRQn            =   -14,    /*!< Cortex-M3 Non-maskable Interrupt */
  HardFault_IRQn                 =   -13,    /*!< Cortex-M3 Hardware Fault */
  MemoryManagement_IRQn          =   -12,    /*!< Cortex-M3 Memory Management Interrupt */
  BusFault_IRQn                  =   -11,    /*!< Cortex-M3 Bus Fault */
  UsageFault_IRQn                =   -10,    /*!< Cortex-M3 Usage Fault */
  SVCall_IRQn                    =    -5,    /*!< Cortex-M3 SVCall Interrupt */
  DebugMonitor_IRQn              =    -4,    /*!< Cortex-M3 Debug Monitor */
  PendSV_IRQn                    =    -2,    /*!< Cortex-M3 PendSV Interrupt */
  SysTick_IRQn                   =    -1,    /*!< Cortex-M3 SysTick Interrupt */
  RTC1_EVT_IRQn                  =     0,    /*!< Event */
  XINT_EVT1_IRQn                 =     2,    /*!< External Wakeup Interrupt n */
  AFE_EVT3_IRQn                  =     4,    /*!< AFE Interrupt */
  WDT_EXP_IRQn                   =     5,    /*!< Digital Die Watchdog */
  PMG0_VREG_OVR_IRQn             =     6,    /*!< Voltage Regulator (VREG) Overvoltage */
  PMG0_BATT_RANGE_IRQn           =     7,    /*!< Battery Voltage (VBAT) Out of Range */
  RTC0_EVT_IRQn                  =     8,    /*!< RTC0 Event */
  SYS_GPIO_INTA_IRQn             =     9,    /*!< GPIO Interrupt A */
  SYS_GPIO_INTB_IRQn             =    10,    /*!< GPIO Interrupt B */
  TMR0_EVT_IRQn                  =    11,    /*!< Event */
  TMR1_EVT_IRQn                  =    12,    /*!< Event */
  FLCC_EVT_IRQn                  =    13,    /*!< Event */
  UART_EVT_IRQn                  =    14,    /*!< Event */
  SPI0_EVT_IRQn                  =    15,    /*!< Event */
  SPI1_EVT_IRQn                  =    16,    /*!< SPI1 interrupt */
  I2C_SLV_EVT_IRQn               =    17,    /*!< Slave Event */
  I2C_MST_EVT_IRQn               =    18,    /*!< Master Event */
  DMA_CHAN_ERR_IRQn              =    19,    /*!< DMA Error */
  DMA0_CH0_DONE_IRQn             =    20,    /*!< Channel SPI1_TX Done */
  DMA0_CH1_DONE_IRQn             =    21,    /*!< Channel SPI1_RX Done */
  DMA0_CH2_DONE_IRQn             =    22,    /*!< Channel 2 Done */
  DMA0_CH3_DONE_IRQn             =    23,    /*!< Channel 3 Done */
  DMA0_CH4_DONE_IRQn             =    24,    /*!< Channel SPI0_TX Done */
  DMA0_CH5_DONE_IRQn             =    25,    /*!< Channel SPI0_RX Done */
  DMA0_CH6_DONE_IRQn             =    26,    /*!< Channel 6 Done */
  DMA0_CH7_DONE_IRQn             =    27,    /*!< Channel 7 Done */
  DMA0_CH8_DONE_IRQn             =    28,    /*!< Channel UART_TX Done */
  DMA0_CH9_DONE_IRQn             =    29,    /*!< Channel UART_RX Done */
  DMA0_CH10_DONE_IRQn            =    30,    /*!< Channel I2C0_STX Done */
  DMA0_CH11_DONE_IRQn            =    31,    /*!< Channel I2C0_SRX Done */
  DMA0_CH12_DONE_IRQn            =    32,    /*!< Channel I2C0_MX Done */
  DMA0_CH13_DONE_IRQn            =    33,    /*!< Channel AES_IN_Done */
  DMA0_CH14_DONE_IRQn            =    34,    /*!< Channel AES_OUT_Done */
  DMA0_CH15_DONE_IRQn            =    35,    /*!< Channel FLASH0_Done */
  CRYPT_EVT_IRQn                 =    38,    /*!< Event */
  TMR2_EVT_IRQn                  =    40,    /*!< Event */
  CLKG_PLL_EVT_IRQn              =    43,    /*!< PLL Event */
  RNG0_EVT_IRQn                  =    44,    /*!< RNG0_EVT */
  AFE_ERROR_IRQn                 =    47,    /*!< AFE_ERROR */
  AFE_ADC_IRQn                   =    48,    /*!< AFE_ADC */
  AFE_GEN_IRQn                   =    49,    /*!< AFE_GEN */
  AFE_CMDFIFO_IRQn               =    50,    /*!< AFE_CMDFIFO */
  AFE_DATAFIFO_IRQn              =    51,    /*!< AFE_DATAFIFO */
  AFE_Watchdog_IRQn              =    52,    /*!< AFE_Watchdog */
  AFE_CRC_IRQn                   =    53,    /*!< AFE_CRC */
  AFE_GPT0_IRQn                  =    54,    /*!< AFE_GPT0 */
  AFE_GPT1_IRQn                  =    55,    /*!< AFE_GPT1 */
  DMA0_CH16_DONE_IRQn            =    56,    /*!< AFE_DMA_CMDFIFO */
  DMA0_CH17_DONE_IRQn            =    57,    /*!< AFE_DMA_DATAFIFO */
  DMA0_CH18_DONE_IRQn            =    58,    /*!< Channel 18 Done */
  DMA0_CH19_DONE_IRQn            =    59,    /*!< Channel 19 Done */
  DMA0_CH20_DONE_IRQn            =    60,    /*!< Channel 20 Done */
  DMA0_CH21_DONE_IRQn            =    61,    /*!< Channel 21 Done */
  DMA0_CH22_DONE_IRQn            =    62,    /*!< Channel 22 Done */
  DMA0_CH23_DONE_IRQn            =    63,    /*!< Channel 23 Done */
  AGPT0_EVT_IRQn                 =    64,    /*!< AGPT0_EVT */
  AGPT1_EVT_IRQn                 =    65,    /*!< AGPT1_EVT */
} IRQn_Type;  /* typedef name for fixed interrupt numbers */
#endif /* !__ADI_NO_DECL_ENUM_IRQn_Type__ */



#if defined (_MISRA_RULES)
#pragma diag(pop)
#endif /* _MISRA_RULES */


#if defined (__CC_ARM)
#pragma pop
#endif 

#endif
